import React, { useState, useEffect } from 'react'
import { NavDropdown } from 'react-bootstrap'
import './DateDropdown.scss'

import { API, graphqlOperation } from 'aws-amplify'
import { getJobDescribes } from '../graphql/queries'
import { format, sub, eachMonthOfInterval } from 'date-fns'
import { getKstDate } from '../utils/date'


const DateDropdown = ({ dateRange, date, setDate }) => {
  const dateFormat = 'yyyy-MM'
  const [jobDescribes, setJobDescribes] = useState([])

  // useEffect(() => {
  //   const fetchJdList = async () => {
  //     const _jds = await API.graphql(graphqlOperation(getJobDescribes, { date: date }))
  //     setJobDescribes(_jds)
  //     console.log(_jds)
  //   }
  //   fetchJdList()
  // }, [date])

  const handleSelect = (eventKey) => {
    setDate(eventKey)
  }

  return (
    <div className="date-dropdown">
      <NavDropdown title={date} id="nav-dropdown" onSelect={handleSelect}>
        {
          dateRange.map(date => {
            const _date = format(date, dateFormat)
            return <NavDropdown.Item key={_date} eventKey={_date}>{_date}</NavDropdown.Item>
          })
        }
      </NavDropdown>
    </div>   
  )
}

export default DateDropdown

/*
data:
  listJobAnalyses:
    items: Array(9)
      0:
      advance: (108) ['[jquery, 8]', '[모바일, 4]', '[이해도, 4]', '[git, 4]', '[es, 4]', '[javascript, 4]', '[서비스, 3]', '[관리, 3]', '[협업, 3]', '[웹사이트, 3]', '[구축, 3]', '[프론트엔드, 3]', '[검색, 3]', '[엔진, 3]', '[최적화, 3]', '[신분, 3]', '[react, 3]', '[svn, 3]', '[seo, 3]', '[환경, 2]', '[퍼블리싱, 2]', '[버전, 2]', '[반응, 2]', '[빌드, 2]', '[도구, 2]', '[산업, 2]', '[하이브리드, 2]', '[기획, 2]', '[커뮤니케이션, 2]', '[디자인, 2]', '[인터, 2]', '[유지, 2]', '[보수, 2]', '[asp, 2]', '[php, 2]', '[webpack, 2]', '[zeplin, 2]', '[photoshop, 2]', '[ui, 2]', '[교육, 1]', '[웹접근성, 1]', '[워드프레스, 1]', '[프레임워크, 1]', '[백엔드, 1]', '[전공자, 1]', '[장기, 1]', '[적응, 1]', '[사이드, 1]', '[접근, 1]', '[배움, 1]', '[의지, 1]', '[운용, 1]', '[이상인, 1]', '[전반, 1]', '[크로스, 1]', '[브라우징, 1]', '[에이전시, 1]', '[출신, 1]', '[형상, 1]', '[매사, 1]', '[적극, 1]', '[스스로, 1]', '[버그, 1]', '[바로, 1]', '[고치, 1]', '[방향, 1]', '[석사, 1]', '[대회, 1]', '[입상, 1]', '[애니메이션, 1]', '[랙티브, 1]', '[페이지, 1]', '[플러그인, 1]', '[신규, 1]', '[렉션, 1]', '[웹앱, 1]', '[소스, 1]', '[대규모, 1]', '[금융, 1]', '[증권, 1]', '[커머스, 1]', '[여행, 1]', '[목업, 1]', '[제작, 1]', '[코딩, 1]', '[제주, 1]', '[vue, 1]', '[gulp, 1]', '[scss, 1]', '[office, 1]', '[css, 1]', '[web, 1]', '[front, 1]', '[classic, 1]', '[ms, 1]', '[sql, 1]', '[gtq, 1]', '[bootstrap, 1]', '[github, 1]', '[illustrator, 1]', …]
      analysisCount: 18
      benefit: (168) ['[선물, 7]', '[생일, 7]', '[명절, 6]', '[추가, 5]', '[직원, 5]', '[근속, 4]', '[자기계발, 4]', '[교육, 4]', '[검진, 4]', '[도서, 4]', '[point, 4]', '[제도, 3]', '[제휴, 3]', '[콘도, 3]', '[축하, 3]', '[건강, 3]', '[센티, 3]', '[사내, 3]', '[장기, 3]', '[건강검진, 3]', '[선택, 2]', '[누구, 2]', '[매년, 2]', '[충전, 2]', '[최대, 2]', '[비용, 2]', '[석식, 2]', '[식사, 2]', '[상품권, 2]', '[종합, 2]', '[개인, 2]', '[동호회, 2]', '[운영, 2]', '[포상, 2]', '[구입, 2]', '[카페테리아, 2]', '[휴무, 2]', '[조금, 2]', '[데이, 2]', '[조휴, 2]', '[조기, 2]', '[퇴근, 2]', '[대비, 2]', '[출장, 2]', '[fit, 2]', '[시기, 1]', '[당신, 1]', '[일간, 1]', '[단위, 1]', '[누리, 1]', '[더욱, 1]', '[성과, 1]', '[출하, 1]', '[수강, 1]', '[향상, 1]', '[연간, 1]', '[간식, 1]', '[휴식, 1]', '[공간, 1]', '[라운지, 1]', '[원두, 1]', '[커피, 1]', '[음료, 1]', '[군것질, 1]', '[거리, 1]', '[계절, 1]', '[과일, 1]', '[마련, 1]', '[두뇌, 1]', '[식당, 1]', '[저녁, 1]', '[집중, 1]', '[리조트, 1]', '[한솔, 1]', '[오크, 1]', '[밸리, 1]', '[대명, 1]', '[비발디, 1]', '[전국, 1]', '[각지, 1]', '[날짜, 1]', '[언제, 1]', '[풍요, 1]', '[구매, 1]', '[또한, 1]', '[맞이, 1]', '[백화점, 1]', '[생활, 1]', '[관리, 1]', '[부서장, 1]', '[공단, 1]', '[혈액, 1]', '[검사, 1]', '[점심, 1]', '[유연근무제, 1]', '[상여금, 1]', '[법정, 1]', '[근로, 1]', '[준수, 1]', '[가입, 1]', …]
      company: (18) ['(주)NE능률', '(주)아이파트너즈', '(주)파수', '넥스트리(주)', '(주)펜타브리드', '넥스트플로어(주)', '오픈오브젝트(주)', '잡플래닛 매칭서비스', '(주)엑스퍼트컨설팅', '(주)에스앤제이홀딩스', '크루메이트(주)', '(주)뉴링크', '(주)미디어윌', '(주)디벨록', '(주)이스트게임즈', '비티씨코리아닷컴(주)', '라인게임즈(주)', '(주)캐플릭스']
      etc: (19) ['[공고, 2]', '[여부, 2]', '[조기, 2]', '[연장, 2]', '[필요, 2]', '[추가, 2]', '[인터뷰, 2]', '[과제, 2]', '[별도, 2]', '[평균, 1]', '[연봉, 1]', '[언주로, 1]', '[이내, 1]', '[위주, 1]', '[기록, 1]', '[문서, 1]', '[반환, 1]', '[목적, 1]', '[ms, 1]']
      introduce: (197) ['[여행, 10]', '[서비스, 8]', '[지점, 8]', '[디지털, 5]', '[플랫폼, 5]', '[우리, 5]', '[지사, 5]', '[캐플릭스, 5]', '[가맹, 4]', '[세상, 4]', '[고객, 3]', '[시작, 3]', '[파수, 2]', '[문서, 2]', '[자체, 2]', '[보안, 2]', '[가능성, 2]', '[위치, 2]', '[발전, 2]', '[기준, 2]', '[기여, 2]', '[지도, 2]', '[실시간, 2]', '[퀘스트, 2]', '[거래, 2]', '[연구, 2]', '[사업자, 2]', '[신고, 2]', '[등록, 2]', '[전국, 2]', '[현재, 2]', '[중구, 2]', '[북구, 2]', '[남구, 2]', '[모빌리티, 2]', '[렌터카, 2]', '[패스, 2]', '[모자이, 2]', '[사용자, 2]', '[인터페이스, 2]', '[drm, 2]', '[세계, 1]', '[최초, 1]', '[상용, 1]', '[지난, 1]', '[글로벌, 1]', '[진가, 1]', '[대한민국, 1]', '[대표, 1]', '[보호, 1]', '[생애, 1]', '[주기, 1]', '[청사진, 1]', '[제시, 1]', '[또한, 1]', '[애플리케이션, 1]', '[생산, 1]', '[지속, 1]', '[확장, 1]', '[진입, 1]', '[장벽, 1]', '[부가가치, 1]', '[개척, 1]', '[방식, 1]', '[혁신, 1]', '[크게, 1]', '[시대, 1]', '[무한, 1]', '[선도, 1]', '[실현, 1]', '[당신, 1]', '[브리, 1]', '[자본금, 1]', '[억원, 1]', '[매출, 1]', '[사원수, 1]', '[규모, 1]', '[고용노동부, 1]', '[선정, 1]', '[강소기업, 1]', '[서운로, 1]', '[서초동, 1]', '[오프라인, 1]', '[통합, 1]', '[마케팅, 1]', '[코스닥, 1]', '[장사, 1]', '[알뜰폰, 1]', '[전개, 1]', '[저희, 1]', '[에스, 1]', '[앤제이, 1]', '[홀딩스, 1]', '[전문가, 1]', '[데이터베이스, 1]', '[선별, 1]', '[신뢰, 1]', '[사회, 1]', '[경제, 1]', '[구인, 1]', …]
      requirement: (126) ['[html, 11]', '[css, 11]', '[반응, 8]', '[jquery, 8]', '[javascript, 7]', '[웹표준, 6]', '[웹접근성, 6]', '[크로스, 6]', '[브라우징, 6]', '[모바일, 6]', '[커뮤니케이션, 5]', '[포트폴리오, 5]', '[운영, 4]', '[기획, 4]', '[java, 4]', '[년제, 3]', '[코딩, 3]', '[디자인, 3]', '[개선, 3]', '[구축, 3]', '[채널, 3]', '[적극, 3]', '[퍼블리싱, 3]', '[photoshop, 3]', '[script, 3]', '[하드, 2]', '[협업, 2]', '[대학, 2]', '[포토샵, 2]', '[제작, 2]', '[분석, 2]', '[적응, 2]', '[과제, 2]', '[별도, 2]', '[실시, 2]', '[표준, 2]', '[작업, 2]', '[충정로, 2]', '[react, 2]', '[ui, 2]', '[ux, 2]', '[pm, 2]', '[sns, 2]', '[scss, 2]', '[초대, 1]', '[이상인, 1]', '[유관, 1]', '[졸업, 1]', '[학사, 1]', '[이해도, 1]', '[이슈, 1]', '[성능, 1]', '[문제, 1]', '[진단, 1]', '[플러그인, 1]', '[웹서비스, 1]', '[제안, 1]', '[포인트, 1]', '[도출, 1]', '[활성화, 1]', '[이벤트, 1]', '[프로모션, 1]', '[사용성, 1]', '[방안, 1]', '[제시, 1]', '[고객, 1]', '[현황, 1]', '[벤치마킹, 1]', '[리포트, 1]', '[지표, 1]', '[통계, 1]', '[트렌드, 1]', '[사고방식, 1]', '[브랜드, 1]', '[디지털, 1]', '[캠페인, 1]', '[실행, 1]', '[인스타그램, 1]', '[페이스북, 1]', '[개인, 1]', '[커뮤니티, 1]', '[첨부, 1]', '[성격, 1]', '[소유자, 1]', '[화면, 1]', '[설계, 1]', '[정의, 1]', '[태도, 1]', '[행동, 1]', '[창의, 1]', '[해외여행, 1]', '[결격, 1]', '[사유, 1]', '[대해, 1]', '[이해력, 1]', '[대응, 1]', '[본부, 1]', '[서대문구, 1]', '[동아일보, 1]', '[사옥, 1]', …]
      role: (70) ['[퍼블리싱, 13]', '[서비스, 8]', '[유지, 6]', '[보수, 6]', '[신규, 5]', '[구축, 4]', '[운영, 4]', '[ui, 4]', '[이벤트, 3]', '[플랫폼, 3]', '[프로모션, 2]', '[관리, 2]', '[웹서비스, 2]', '[컨텐츠, 2]', '[코딩, 2]', '[제작, 2]', '[포토샵, 2]', '[디자인, 2]', '[페이지, 2]', '[html, 2]', '[css, 2]', '[ux, 2]', '[script, 2]', '[영문, 1]', '[마케팅, 1]', '[콘텐츠, 1]', '[뉴스레터, 1]', '[프론트엔드, 1]', '[표준, 1]', '[규격, 1]', '[준수, 1]', '[접근성, 1]', '[반응, 1]', '[컨설팅, 1]', '[교육, 1]', '[프로그램, 1]', '[코칭, 1]', '[화면, 1]', '[설계, 1]', '[프로세스, 1]', '[정립, 1]', '[커뮤니케이션, 1]', '[정리, 1]', '[기획, 1]', '[사내, 1]', '[시스템, 1]', '[일러스트, 1]', '[이미지, 1]', '[수정, 1]', '[구인, 1]', '[구직, 1]', '[부동산, 1]', '[퀘스트, 1]', '[출시, 1]', '[예정, 1]', '[월드, 1]', '[일러스트레이터, 1]', '[작업, 1]', '[브랜드, 1]', '[리뉴얼, 1]', '[마이크로, 1]', '[인터, 1]', '[렉션, 1]', '[애니메이션, 1]', '[php, 1]', '[react, 1]', '[js, 1]', '[si, 1]', '[mobile, 1]', '[web, 1]']
      search: "웹 퍼블리셔"
      summary_experience: (7) ['[신입, 5]', '[경력무관, 3]', '[1년 이상, 5]', '[3년 이상, 6]', '[2년 이상, 1]', '[5년 이상, 1]', '[4년 이상, 1]']
      summary_salary: (9) ['[3200, 1]', '[4000, 1]', '[5000, 1]', '[6000, 1]', '[7000, 1]', '[8000, 1]', '[9000, 1]', '[회사내규에 따름, 12]', '[면접 후 결정, 3]']
      summary_skill: (28) ['[CSS, 6]', '[HTML, 4]', '[jquery, 3]', '[웹접근성, 2]', '[웹퍼블리셔, 2]', '[HTML5, 2]', '[UX, 2]', '[UI, 2]', '[웹디자인, 2]', '[Javascript, 2]', '[모바일웹, 1]', '[반응형웹, 1]', '[크로스브라우징, 1]', '[React.js, 1]', '[web 개발, 1]', '[java, 1]', '[개발, 1]', '[CSS3, 1]', '[jsp, 1]', '[Spring, 1]', '[유지보수, 1]', '[포토샵, 1]', '[java script, 1]', '[웹, 1]', '[모바일, 1]', '[브랜딩, 1]', '[디자인, 1]', '[웹퍼블리싱, 1]']
      targetDate: "2021-12"

*/